; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   orange_block_1 black_block_1 white_block_1 purple_block_1 white_block_2 grey_block_1 yellow_block_1 - block
 )
 (:init (ontable orange_block_1) (ontable black_block_1) (ontable white_block_1) (ontable purple_block_1) (on white_block_2 orange_block_1) (ontable grey_block_1) (on yellow_block_1 grey_block_1) (clear black_block_1) (clear white_block_1) (clear purple_block_1) (clear white_block_2) (clear yellow_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (ontable yellow_block_1)))
 (:constraints (sometime (ontable white_block_2)) (sometime (holding yellow_block_1)) (sometime-before (holding yellow_block_1) (holding black_block_1)) (sometime (or (clear orange_block_1) (not (ontable grey_block_1)))) (sometime (not (on orange_block_1 yellow_block_1))) (sometime-after (not (on orange_block_1 yellow_block_1)) (or (on grey_block_1 white_block_1) (not (clear white_block_1)))) (sometime (clear orange_block_1)) (sometime (clear grey_block_1)) (sometime-before (clear grey_block_1) (or (on black_block_1 orange_block_1) (not (clear purple_block_1)))) (sometime (not (on black_block_1 purple_block_1))) (sometime-after (not (on black_block_1 purple_block_1)) (or (ontable white_block_2) (holding yellow_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack white_block_2 orange_block_1)
   deleted: (on white_block_2 orange_block_1) (clear white_block_2) (handempty)
   added: (holding white_block_2) (clear orange_block_1)
   goals met: 0 of 1
2. (putdown white_block_2)
   deleted: (holding white_block_2)
   added: (clear white_block_2) (handempty) (ontable white_block_2)
   goals met: 0 of 1
3. (pickup black_block_1)
   deleted: (clear black_block_1) (ontable black_block_1) (handempty)
   added: (holding black_block_1)
   goals met: 0 of 1
4. (stack black_block_1 purple_block_1)
   deleted: (clear purple_block_1) (holding black_block_1)
   added: (handempty) (clear black_block_1) (on black_block_1 purple_block_1)
   goals met: 0 of 1
5. (pickup white_block_2)
   deleted: (clear white_block_2) (ontable white_block_2) (handempty)
   added: (holding white_block_2)
   goals met: 0 of 1
6. (stack white_block_2 white_block_1)
   deleted: (clear white_block_1) (holding white_block_2)
   added: (handempty) (clear white_block_2) (on white_block_2 white_block_1)
   goals met: 0 of 1
7. (unstack yellow_block_1 grey_block_1)
   deleted: (on yellow_block_1 grey_block_1) (clear yellow_block_1) (handempty)
   added: (holding yellow_block_1) (clear grey_block_1)
   goals met: 0 of 1
8. (putdown yellow_block_1)
   deleted: (holding yellow_block_1)
   added: (clear yellow_block_1) (handempty) (ontable yellow_block_1)
   goals met: 1 of 1
